package ru.geekbrains.java_1;
// 1.	Создать класс "Сотрудник" с полями: Фамилия, зарплата, возраст, должность;
// 2.	Конструктор класса должен заполнять эти поля при создании объекта;

// 3.	Внутри класса «Сотрудник» написать методы, которые возвращают значение каждого поля;
// 4.	Вывести при помощи методов из пункта 3 ФИО и должность.
// 5.	Создать массив из 5 сотрудников. С помощью цикла вывести информацию только о сотрудниках старше 40 лет;

public class Staffer {
    String surname;
    int salary;
    int age;
    String position;

    Staffer(String surname, int salary, int age, String position) {

    }




}
